-- https://www.cnblogs.com/guokaifeng/p/11192266.html
-- 内连接、左外连接、右外连接

MariaDB [chenli]> select * from department;
+------+-----------------+
| id   | name            |
+------+-----------------+
|  200 | 挖矿小分队      |
|  201 | 人力资源        |
|  202 | 销售            |
|  203 | 运营            |
+------+-----------------+
4 rows in set (0.00 sec)

MariaDB [chenli]> select * from staff;
+----+-----------+--------+------+--------+
| id | name      | sex    | age  | dep_id |
+----+-----------+--------+------+--------+
|  1 | 程咬金    | male   |   38 |    200 |
|  2 | 露娜      | female |   26 |    201 |
|  3 | 李白      | male   |   38 |    201 |
|  4 | 王昭君    | female |   28 |    202 |
|  5 | 典韦      | male   |  118 |    200 |
|  6 | 小乔      | female |   16 |    204 |
+----+-----------+--------+------+--------+
6 rows in set (0.00 sec)

-- 内连接：找到两张表共有的部分
MariaDB [chenli]> select * from staff inner join department on staff.dep_id = department.id;
+----+-----------+--------+------+--------+------+-----------------+
| id | name      | sex    | age  | dep_id | id   | name            |
+----+-----------+--------+------+--------+------+-----------------+
|  1 | 程咬金    | male   |   38 |    200 |  200 | 挖矿小分队      |
|  2 | 露娜      | female |   26 |    201 |  201 | 人力资源        |
|  3 | 李白      | male   |   38 |    201 |  201 | 人力资源        |
|  4 | 王昭君    | female |   28 |    202 |  202 | 销售            |
|  5 | 典韦      | male   |  118 |    200 |  200 | 挖矿小分队      |
+----+-----------+--------+------+--------+------+-----------------+
5 rows in set (0.00 sec)

-- 左外连接：优先显示左表的全部记录
MariaDB [chenli]> select * from staff left join department on staff.dep_id = department.id ;
+----+-----------+--------+------+--------+------+-----------------+
| id | name      | sex    | age  | dep_id | id   | name            |
+----+-----------+--------+------+--------+------+-----------------+
|  1 | 程咬金    | male   |   38 |    200 |  200 | 挖矿小分队      |
|  5 | 典韦      | male   |  118 |    200 |  200 | 挖矿小分队      |
|  2 | 露娜      | female |   26 |    201 |  201 | 人力资源        |
|  3 | 李白      | male   |   38 |    201 |  201 | 人力资源        |
|  4 | 王昭君    | female |   28 |    202 |  202 | 销售            |
|  6 | 小乔      | female |   16 |    204 | NULL | NULL            |
+----+-----------+--------+------+--------+------+-----------------+
6 rows in set (0.00 sec)

-- 右外连接：优先显示右标的全部记录
MariaDB [chenli]> select * from staff right join department on staff.dep_id = department.id ;
+------+-----------+--------+------+--------+------+-----------------+
| id   | name      | sex    | age  | dep_id | id   | name            |
+------+-----------+--------+------+--------+------+-----------------+
|    1 | 程咬金    | male   |   38 |    200 |  200 | 挖矿小分队      |
|    2 | 露娜      | female |   26 |    201 |  201 | 人力资源        |
|    3 | 李白      | male   |   38 |    201 |  201 | 人力资源        |
|    4 | 王昭君    | female |   28 |    202 |  202 | 销售            |
|    5 | 典韦      | male   |  118 |    200 |  200 | 挖矿小分队      |
| NULL | NULL      | NULL   | NULL |   NULL |  203 | 运营            |
+------+-----------+--------+------+--------+------+-----------------+
6 rows in set (0.00 sec)